backend/controllers/SiteController.php

                        }else{
                            Yii::$app->user->login($resUser, $rememberMe ? 3600 * 24 * 30 : 0);
                            $user->last_active = time();
                            $user->save(false);
---
UPDATE `user` SET `last_active`=1738058290, `updated_at`=1738058290 WHERE `id`=1