common/components/FileUpload.php

SELECT * FROM `setting`
---
    function __construct()
    {
        $modelSetting = new Setting();
        $settingResult = $modelSetting->find()->one();