common/models/Setting.php

SELECT * FROM `setting` ORDER BY `id` DESC
---
    public function getSettingData()
    {
        return $this->find()->orderBy(['id'=>SORT_DESC])->one();

SELECT * FROM `setting` ORDER BY `id` DESC
UPDATE `setting` SET `site_url`='https://example.com' WHERE `id`=1
---
    public function updateSettingData()
    {
        $res= $this->find()->orderBy(['id'=>SORT_DESC])->one();
        $res->site_url = Yii::$app->params['siteUrl'];
        $res->save(false);