backend/components/AuthPermission.php

SELECT * FROM `module_auth` WHERE (`module_auth`.`alias`='user') AND (`module_auth`.`level`=1)
---
			return true;
		}*/
    $uid =Yii::$app->user->identity->id;
    $resultModule = $modelModuleAuth->find()->Where(['module_auth.alias' => $moduleName,'module_auth.level' => 1])->one();